[
  {
    "path": "posts/welcome/",
    "title": "Welcome to DataViz Makeover",
    "description": "Welcome to our new blog, DataViz Makeover. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Yin Xiaolan",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-26",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-26T14:23:02+08:00",
    "input_file": {}
  },
  {
    "path": "posts/DataViz Makeover 1/",
    "title": "DataViz Makeover 1",
    "description": "In the first DataViz Makeover, we are going to create a new visualization and get some insights using the merchandise trade data.",
    "author": [
      {
        "name": "Yin Xiaolan",
        "url": "https://www.linkedin.com/in/yin-xiaolan-840b561b8/"
      }
    ],
    "date": "2021-05-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critics\r\n1.1 Original Visualization\r\n1.2 Critics of Clarity\r\n1.3 Critics of Aesthetics\r\n\r\n2.0 Alternative Graphical Presentation\r\n2.1 Sketch\r\n2.2 Advantages\r\n2.2.1 clarity\r\n2.2.2 Aesthetics\r\n2.2.3 Other added information\r\n\r\n\r\n3.0 Tableau Design\r\n4.0 Step-by-step Description\r\n4.1 Data Preparation\r\n4.1.1 Get the data for Import/Export/BOT\r\n4.1.2 Get the data for year-on-year ratio graph\r\n\r\n4.2 Data Visualization\r\n4.2.1 Set the data source\r\n4.2.2 Set the correct data category\r\n4.2.3 Create a visualization for Import/Export/BOT\r\n4.2.4 Create a visualization for year-on-year ratio\r\n4.2.5 Create a dash board\r\n\r\n\r\n5.0 Observations\r\n5.1 Value of Imports/Exports\r\n5.2 Balance of Trade\r\n5.3 Year-on-year Ratio\r\n\r\n\r\n1.0 Critics\r\nThe statistics on merchandise trade are from Department of Statisitcs Singapore, ‘Merchandise Trade by Region/Market’.\r\nWe are going to use this data set to get some insights.\r\n1.1 Original Visualization\r\nFrom the data set we can see that there are import data and export data of hundreds of countries and the original visualization below select six countries to see the details in 2019-2020.\r\n\r\n1.2 Critics of Clarity\r\nThe original visualization has some drawbacks which may mislead readers or convey inaccurate information.\r\nThe periods are not consistent. The ‘month of period’ of Japan is different from all the other 5 countries, it only has 2020, which is inconsistent with the title.\r\nThe Y axes are inconsistent. There are two Y-axes in every sub-picture, one for import and one for export. The two Y-axes have different scales. This may mislead readers if the pictures are similar but the scales are significantly different. What’s more, the different scales of the Y-axes of all 6 sub-pictures makes it difficult for readers to make the comparison among the 6 countries.\r\nThe Y axes are not accurate. We can see from the raw data that the unit is thousand dollars, but there is no note to explain this in the original visualization. This will mislead readers to treat the actually 4M thousand dollars to be just 4M dollars.\r\nThe title is not accurate. The figure cannot reflect that the six countries are the top six trading countries. And from the data set we can see that the top six countries of import, export, or total values are all not consistent with the six countries in the figure.\r\n\r\nThere is no subtitle and the title only introduces what are the pictures but cannot convey the point the pictures are going to present. No lead-in or called-out to offer the context.\r\n1.3 Critics of Aesthetics\r\nThe original visualization has some parts may not be that beautiful.\r\nThe area charts are not necessary. It does not convey any information, the overlap area makes is difficult to see clearly.\r\nThe color of import and export is not suitable. The overlap of light blue and light yellow makes the graph looks dirty, not clean.\r\nThe separate of six sub-graph distract readers and will lead readers to treat them separately.\r\n2.0 Alternative Graphical Presentation\r\nWe are going to create a sketch of what we are going to design, so that the following creating steps can go for that goal.\r\n2.1 Sketch\r\n\r\n2.2 Advantages\r\n2.2.1 clarity\r\nWe keep the period of all six countries to 2019 - 2020 so that it is consistent within the graph and fit what we are going to express.\r\nThe Import and Export use the same Y axis. also, all six countries use the same Y axis. Then it is absolutely clear for readers to make comparison.\r\nWe add a note in a pair of brackets to make readers know the value unit is thousand dollars.\r\nWe edit the title from ‘top six trading countries’ to ‘six large trading countries’. Avoid the misleading expression.\r\nWe edit the titles, add subtitles and annotations to graphs, and create dashboard titles.\r\n2.2.2 Aesthetics\r\nWe use line chart instead of area chart to make the graph neat and clean.\r\nWe set the color to blue and red (and gray if one more color needed) to make it looks beautiful.\r\nInstead of six separate sub-graph, we let the six countries next to each other so that readers will pay more attention to the comparison.\r\n2.2.3 Other added information\r\nBalance of Trade (BOT) is an important concept in analysis the trade, we add such a value in the graph to make it more straightforward. We use gray line to represent it.\r\nYear-on-year Ratio helps to analysis the different between the trade values of this period and that of last period. We create a new line chart to reflect the year-on-year ratio of import and export of all six countries.\r\n3.0 Tableau Design\r\nThe final visualization is shown below.\r\nThis link Trade Viz provides the tableau public website.\r\n\r\n4.0 Step-by-step Description\r\nNow we comes to the details of creating the new visualization.\r\n4.1 Data Preparation\r\nFirst of all, we download the data ‘outputFile.xlsx’ from the official website and check all the data we have. It contains three sheets, one is content, one is T1 (import) and another is T2 (export).\r\nWe can know that we have the import and export data of hundreds of countries in different time, the total number of countries of import and export are different (import 120 countries, export 92 countries), and the time period starts from Jan 1976, ends in Apr 2021.\r\n4.1.1 Get the data for Import/Export/BOT\r\nWe just need to get the sheet contains only the data without other information.\r\nOpen the excel, copy the T1 sheet, which contains the import data, named the new sheet ‘import’ and delete the rows contains other information before and after the data.\r\nbefore: \r\nafter: \r\nDo the same steps for export data (T2) and get a new sheet ‘export’.\r\n4.1.2 Get the data for year-on-year ratio graph\r\nWe are going to get the statistic of import and export compare with the performance last year, only for 2020.\r\nMake copies of import and export sheet, named ‘Im_inter’ and ‘Ex_inter’. In the ‘Im_inter’ sheet, select the cells of first row and add a filter. In the ‘variables’ column select the specific six countries.\r\nCopy the value from Jan 2019 to Dec 2020 and paste below.\r\n\r\nIn the cell below 2020 Jan, type in the formula ‘the year-on-year ratio = (the import value in a specific month in 2020 - the import value of the month in 2019) / the import value of the month in 2019’ and drag down and right to get all the percentage of the six countries in 2020.\r\n\r\nWe copy all the percentage statistics and prepare a new sheet ‘Im_yoyr’ for further tableau exploration.\r\n Then do the same steps for export part and get a new sheet ‘Ex_yoyr’.\r\n4.2 Data Visualization\r\nNow we open the tableau and start to create our visualization.\r\n4.2.1 Set the data source\r\nWe import the ‘outputFile.xlsx’ and drag the ‘import’ to the up right window. Select the columns from ‘1976 Jan’ to ‘Apr 2021’ by click the first column, press ‘shift’ and click the last column, right click and select ‘pivot’.\r\n\r\nThen change the name of the three columns to ‘country’, ‘period’ and ‘merchandise import’. Click the ‘abc’ icon above ‘period’ column and change the data type to date, change the type of ‘merchandise import’ from ‘abc’ to ‘number(decimal)’ using the same way. Now the table looks like this.\r\n\r\nThen drag the export to the window and make the same changes. Also, set the relation ship between the import and export. It matches when country in import equals country Ex in export and period equals period Ex, the cardinality is one to one.\r\n\r\nDrag the ‘Im_yoyr’ to the window link to import. select all the columns exclude variables and pivot the table. Do the same changes to column name, column type and the relationship as figure below.\r\n\r\nDo the same steps for ‘Ex_yoyr’ and the result should looks like the figure below.\r\n\r\n4.2.2 Set the correct data category\r\nFirst we check the ‘Tables’ and change the ‘merchandise import’ and ‘merchandise export’ from discrete to continuous.\r\n\r\nAnd Drag ‘merchandise import’ below.\r\n\r\n4.2.3 Create a visualization for Import/Export/BOT\r\nWe are going to make a new visualization of the import and export data of the six countries from 2019 to 2020.\r\nFirst we drag the ‘Country’ of ‘Import’ to ‘Filters’ and check the six countries (Hong Kong, Japan, Mainland China, Malaysia, Taiwan, US), click OK.\r\n Then we drag ‘Periof’ of ‘Import’ to ‘Filters’ and select ‘#year’ click next and check only 2019, 2020.\r\n\r\nWe drag ‘Country’ and ‘Period’ from ‘Import’ to columns, click the plus icon to get the ‘month’ of ‘period’, and change the ‘month’ from discrete to continuous. Then we drag ‘Quarter’ and ‘year’ out.\r\n\r\nWe drag ‘merchandise import’ from ‘import’ to rows. Then drag ‘merchandise export’ from ‘export’ to the Y axis.\r\n\r\nClick the triangle above ‘Tables’ and select ‘create calculate field’, set the name to ‘Balance of Trade’ and the formula is ‘Balance of Trade = value of Exports - value of Imports’.\r\n\r\nDrag the ‘Balance of Trade’ from ‘Measure Names’ to the Y axis and change the color of the three lines.\r\n\r\nFinally, we do following steps to modify the graph.\r\nRight click columns label area and select hide field labels for columns.\r\n\r\nRight click Y axis and change the name of Y axis to ‘Value of Import/Export/Balance of Trade (Thousand Dollars)’.\r\n\r\n\r\nRight click the country name, select edit the X alias for all six countries, delete the space before country name and the note after country name.\r\n\r\n\r\nThen right click title area and edit the title and subtitle.\r\n\r\n\r\nRight click the white space in the graph, hang on annotate and select area to add the annotation to the graph.\r\n\r\nRight click the legend, select edit title and delete it in the new window. Then right click ‘Merchandise Import’ and select edit alias to delete ‘Merchandise’ and remain ‘Import’. Do the same for ‘Export’.\r\n\r\nThe final ‘Merchandise Trade’ is as follow.\r\n\r\n4.2.4 Create a visualization for year-on-year ratio\r\nWe are going to create a line chart to show the year-on-year ratio of both import and export values for the six countries.\r\nWe drag the ‘Period im yoyr’ from ‘Im_yoyr’ to columns, change the level from year to month, and change it from discrete to continuous, remove ‘quarter’ and ‘year’.\r\nDrag the ‘Year-on-year Ratio Import’ and ‘Year-on-year Ratio Export’ from ‘Im_yoyr’ and ‘Ex_yoyr’ to rows.\r\nDrag the ‘Country im yoyr’ from ‘Im_yoyr’ to color.\r\nWe can see the draft as figure below.\r\n\r\nThen we start modify the graph. We edit the title and subtitle, edit the Y axis title, right click the X axis and select edit axis and delete the title in the newly appeared window.\r\n\r\n\r\nThen we edit the legend by right click every country label and select edit alias. We keep the country name only.\r\nFinally add some annotates.The final ‘Year-on-year Ratio’ is as follow.\r\n\r\n4.2.5 Create a dash board\r\nWe drag the ‘Merchandise Trade’ and ‘Year-on-year Ratio’ to the dashboard and adjust them.\r\nThen we check ‘show dashboard title’ and then edit it.\r\n\r\nRight click the dashboard title area and select format title, select two different light gray for the dashboard background and title shading.\r\n\r\n\r\nThe final dashboard snapshot is as follow.\r\n\r\n5.0 Observations\r\n5.1 Value of Imports/Exports\r\nWe can see that Mainland China has the largest import and export values among these six countries. Hong Kong has significantly lower Import value. Japan and Taiwan have relatively similar Export values.\r\nFrom this point of view, we can see that Mainland China has the largest scale of merchandise trade among all the six countries.\r\n\r\n5.2 Balance of Trade\r\nWe can see from the gray lines that Japan seems to have an average of balance of trade closest to 0. Japan and Taiwan have similar Export, but Taiwan has higher trade deficit since it has higher Import. What’s more, Hong Kong faced a high trade surplus since it has a high Export but low Import.\r\n\r\n5.3 Year-on-year Ratio\r\nFrom the year-on-year ratio graph we can see that all the export year-on-year ratios of US are above 0, and all the import year-on-year ratios except one of March are below 0. In other word, the export value of US in 2020 has been witnessed to be increased compared to the previous period while the import value decreased generally.\r\nIt also can be confirmed from balance of trade. We can see that US is going trade surplus in 2020 from trade deficit in 2019.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-27T16:39:41+08:00",
    "input_file": "DataViz-Makeover-1.knit.md"
  }
]
